{
  "id": "antti-klemetti-thesis",
  "title": "Practical Approaches to Cost-Efficient Deep Learning: Taxonomy, Experiments, and Industry Insights",
  "author": "Mikko Raatikainen",
  "authorRole": "University of Helsinki",
  "excerpt": "On Friday the 13th of February 2026, M.Sc. Antti Klemetti defended his PhD thesis on Practical Approaches to Cost-Efficient Deep Learning: Taxonomy, Experiments, and Industry Insights. The thesis is related to research done in the Department of Computer Science and in the Empirical Software Engineering group.",
  "paragraphs": [
    "Antti Klemetti just defended his PhD on the timely topic on costs of AI. AI has been surrounded by considerable hype, with bold promises about its transformative capabilities. Yet behind the excitement lies a less glamorous reality about cost. Organizations have discovered that AI is not inexpensive, and it is entirely possible to spend thousands of euros in a single day on computing resources alone. However, high costs are not inevitable. With thoughtful architectural choices, model optimization, and smarter use of infrastructure, organizations can significantly reduce expenses while still harnessing AI’s potential.",
    "While monetary costs are the primary concern for businesses and directly impact the bottom line, the cost of AI extends beyond finances. Environmental and societal impact is also significant. For example, according to Guardian AI-related CO₂ emissions have been estimated to be comparable to those of New York City, and according to Yle a planned data center in Finland is expeted to use 8 percent of electricy in Finland or the half of newest generation III+ nuclear power plant in Olkiluoto. ",
    "Antti's dissertation includes a survey of the Finnish IT industry, indicating that AI costs are on an upward trajectory. Among 64 AI-related companies surveyed, 61% reported AI costs as a significant or very significant concern and AI-related cloud and hardware expenses are expected to increase from below 10% of total costs in 2025 to an estimated 25–50% by 2028. The thesis also includes a comprehensive literature review focusing on industrial-scale, cost-efficient solutions. This review provides a taxonomy of techniques that organizations can apply to improve cost efficiency. One experimental study examined smaller deep neural networks (DNNs) by removing neurons to reduce model size and computational requirements, demonstrating practical approaches to lowering costs. In addition, an empirical study conducted at IPRally explored the use of spare cloud resources, known as spot instances. The results showed that training costs could be reduced by up to 72% when using spot GPUs. Although resource revocations were a concern, the more significant challenge was the long waiting time required to obtain spot GPUs.",
    "In summary, DNNs and other specialized models remain viable alternatives to large language models (LLMs) for many tasks. It is worth not forgetting whether more specialized, smaller models can effectively meet specific business needs. While cost should not be the sole focus in decision-making, it is an increasingly critical factor alongside accuracy and other more traditional AI performance metrics. This applies not only to monetary efficiency but also to sustainability, infrastructure and society, and European technological sovereignty in a market currently dominated by large international technology and service providers. It will be interesting to see what kinds of technological solutions emerge in the coming years to better balance performance, cost, and sustainability."
  ],
  "date": "2026-02-18",
  "status": "published",
  "tags": ["cost-efficient", "deep learning", "AI"],
  "url": "http://urn.fi/URN:ISBN:978-952-84-2598-4"
}
